{
  "basic_info": {
    "description_header": "Hola",
    "description": " Soy Tatsuhiro Terada. Con una s贸lida base en sistemas de barcos, navegaci贸n y pesca industrial, soy un profesional mar铆timo dedicado a avanzar en el campo a trav茅s de la innovaci贸n y la experiencia. Mi carrera se construye sobre una comprensi贸n integral de las operaciones mar铆timas, desde el an谩lisis de datos para el cumplimiento hasta el desarrollo de herramientas sofisticadas para evaluaciones operativas. Mi trayectoria acad茅mica en ingenier铆a de sistemas, navegaci贸n, aprendizaje autom谩tico y arte de la mariner铆a me ha equipado con una mezcla 煤nica de conocimientos que impulsa mis empe帽os profesionales.",
    "section_name": {
      "about": "Acerca de m铆",
      "projects": "Proyectos",
      "skills": "Habilidades",
      "experience": "Experiencia",
      "education": "Educaci贸n"
    },
    "subsection_name": {
      "knowledge": "Conocimiento",
      "programming": "Programaci贸n"
    }
  },
  "projects": [
    {
      "title": "Control del Balanceo del Barco",
      "startDate": "2024",
      "description": "Este proyecto fue parte de mi tesis de maestr铆a. Desarroll茅 un sistema de control para la estabilizaci贸n del balanceo del barco. El sistema se bas贸 en un aprendizaje profundo por refuerzo que se entren贸 con datos de simulaci贸n.",
      "images": [
        "images/portfolio/03_ship-rolling-control/p1.jpg",
        "images/portfolio/03_ship-rolling-control/p2.jpg"
      ],
      "url": "https://oacis.repo.nii.ac.jp/records/2000162",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python"
        },
        {
          "class": "devicon-pytorch-plain",
          "name": "PyTorch"
        },
        {
          "class": "devicon-matlab-plain",
          "name": "MATLAB"
        }
      ]
    },
    {
      "title": "Visualizador de Emisiones de CO2",
      "startDate": "2023",
      "description": "Este proyecto fue parte de mi investigaci贸n en un trabajo de medio tiempo. El prop贸sito es medir las emisiones de CO2 de los barcos. Desarroll茅 una aplicaci贸n simple que permite visualizar los datos de emisiones de CO2.",
      "images": [
        "images/portfolio/02_co2-emission-viewer/p1.jpg",
        "images/portfolio/02_co2-emission-viewer/p2.jpg"
      ],
      "url": "https://tatsuhiro-porfolio.streamlit.app/CO2_Emission_Viewer",
      "technologies": [
        {
          "class": "devicon-python-plain",
          "name": "Python"
        }
      ]
    },
    {
      "title": "Visualizador de Capturas de Pesca",
      "startDate": "2022",
      "description": "Una de las primeras aplicaciones en las que trabaj茅 durante mis estudios de posgrado. Cre茅 una aplicaci贸n simple que permite visualizar los datos de capturas de pesca.",
      "images": [
        "images/portfolio/01_fishing-catch-viewer/p1.jpg",
        "images/portfolio/01_fishing-catch-viewer/p2.jpg"
      ],
      "url": "https://tatsuhiro-porfolio.streamlit.app/Fishing_Catch_Viewer",
      "technologies": [
        {
          "class": "devicon-r-plain",
          "name": "R"
        },
        {
          "class": "devicon-javascript-plain",
          "name": "JavaScript"
        }
      ]
    }
  ],
  "experience": [
    {
      "company": "Mitsui E&S Shipbuilding Co., Ltd.",
      "title": "Desarrollador de Hardware",
      "years": "04.2024 - presente",
      "mainTech": [
        "Ciberseguridad",
        "Gesti贸n de Bases de Datos"
      ],
      "technologies": [
        "PostgreSQL",
        "Apache"
      ],
      "icon": "fas fa-ship"
    },
    {
      "company": "NPO Marine Technologist.",
      "title": "Investigador a Tiempo Parcial",
      "years": "09.2022 - 02.2024",
      "mainTech": [
        "Visualizaci贸n de Datos",
        "An谩lisis Estad铆stico"
      ],
      "technologies": [
        "Python",
        "Excel"
      ],
      "icon": "fas fa-chart-bar"
    },
    {
      "company": "Tokyo University of Marine Science and Technology",
      "title": "Master en Ingenier铆a",
      "years": "04.2022 - 03.2024",
      "mainTech": [
        "Sistemas de Control",
        "Aprendizaje Autom谩tico",
        "Navegaci贸n de Barcos",
        "Arquitectura Naval"
        
      ],
      "technologies": [        
        "Python",
        "MATLAB"          
      ],
      "icon": "fas fa-graduation-cap"
    },
    {
      "company": "Korea Maritime and Ocean University",
      "title": "Programa de Intercambio: Master en Ingenier铆a",
      "years": "03.2023 - 07.2023",
      "mainTech": [
        "Sistemas de Control",
        "Aprendizaje Autom谩tico",
        "Log铆stica"
      ],
      "technologies": [
        "Python",
        "MATLAB"
      ],
      "icon": "fas fa-sync-alt"
    },
    {
      "company": "National Fisheries University",
      "title": "Licenciatura en Pesquer铆as",
      "years": "04.2018 - 03.2022",
      "mainTech": [
        "Pesquer铆as",
        "Navegaci贸n de Barcos",
        "Arte de la Mariner铆a"
      ],
      "technologies": [
        "R",
        "JavaScript",
        "Python"
      ],
      "icon": "fas fa-graduation-cap"
    }
  ],
    "blog": [
      {
        "slug": "ship-rolling-control",
        "title": "Control de Balanceo de Buque con DDQN",
        "date": "2023-04-01",
        "category": "Aprendizaje por Refuerzo",
        "featuredImage": "../images/portfolio/03_ship-rolling-control/p1.jpg",
        "excerpt": "Este estudio utiliza un algoritmo de Double-Deep Q-Network (DDQN) para controlar la velocidad del buque y reducir el riesgo de resonancia param茅trica bajo olas regulares. El balanceo param茅trico ocurre cuando la relaci贸n de frecuencia de cabeceo-balanceo es de aproximadamente 2:1. Usando un modelo de 2DOF, el estudio examina el acoplamiento no lineal de cabeceo-balanceo en mares de proa. El algoritmo DDQN, entrenado con datos de simulaci贸n, identifica eficazmente escenarios de alto riesgo y ajusta la velocidad para mitigar la resonancia param茅trica, mejorando la estabilidad y seguridad del buque en la navegaci贸n mar铆tima.",
        "content": "<h1>Objetivo de Este Estudio</h1><p>El objetivo de este estudio es investigar el fen贸meno del balanceo param茅trico en los buques, que ocurre en mares agitados y conduce a un movimiento de balanceo inestable. El estudio tiene como objetivo analizar las condiciones que inducen el balanceo param茅trico y explorar m茅todos para mitigar los riesgos asociados con este fen贸meno, particularmente a trav茅s del control de la velocidad del buque y los algoritmos de aprendizaje profundo por refuerzo.</p><h1>Introducci贸n</h1><p>La prevenci贸n de accidentes por vuelco ha sido un tema de investigaci贸n durante muchos a帽os debido a su importancia para garantizar una navegaci贸n segura. Esta tesis investiga el fen贸meno del 'balanceo param茅trico', que los buques encuentran en mares agitados. Este fen贸meno, causado por mares de proa o de popa, conduce a un movimiento de balanceo inestable que aumenta con el tiempo y puede impactar significativamente la estabilidad de un buque.</p><p>El balanceo param茅trico se conoce desde la d茅cada de 1960 y al principio atrajo atenci贸n principalmente como un problema para los buques peque帽os en mares de popa. Sin embargo, en los 煤ltimos a帽os, se ha reconocido como un problema significativo para los grandes buques portacontenedores, especialmente en mares de proa. La OMI ha destacado la importancia de abordar este problema y ha establecido criterios de evaluaci贸n en las 'Directrices Provisionales sobre los Criterios de Estabilidad Intacta de Segunda Generaci贸n - MSC.1/Circ.1627'.</p><h1>M茅todo</h1><p>El estudio emplea una combinaci贸n de simulaciones y algoritmos de aprendizaje profundo por refuerzo para analizar el balanceo param茅trico. Se utilizan las ecuaciones de cabeceo y balanceo del buque para simular el movimiento bajo diferentes condiciones. Se consideran par谩metros clave como la longitud del buque, la manga, la profundidad, las frecuencias angulares naturales, las amplitudes de excitaci贸n de las olas y los coeficientes de amortiguaci贸n.</p><p>Las simulaciones se realizan utilizando el m茅todo de Runge-Kutta de cuarto orden para obtener los cambios en la amplitud del cabeceo y el balanceo a lo largo del tiempo. El estudio tambi茅n explora el uso de algoritmos de Red Q Profunda (DQN) para controlar la velocidad del buque y mitigar el riesgo de balanceo param茅trico al alterar el per铆odo de encuentro con las olas.</p><h1>Resultados</h1><p>Las simulaciones confirman que el balanceo param茅trico ocurre bajo condiciones espec铆ficas, consistentes con investigaciones previas. La introducci贸n de un modelo de control de velocidad del buque reduce el riesgo de balanceo param茅trico. La pol铆tica obtenida a trav茅s del algoritmo Double Deep Q-Network (DDQN) predice con precisi贸n la ocurrencia de balanceo param茅trico y controla la velocidad del buque adecuadamente, reduciendo los riesgos asociados.</p><p>Ajustar la compensaci贸n entre la velocidad del buque y el movimiento a trav茅s de la configuraci贸n de la funci贸n de recompensa en el aprendizaje DDQN permite cambios flexibles en los umbrales, demostrando la efectividad del enfoque.</p><h1>Conclusi贸n</h1><p>Este estudio verifica las condiciones y los riesgos del balanceo param茅trico a trav茅s de simulaciones y demuestra la validez de aplicar el aprendizaje profundo por refuerzo. Los principales conocimientos obtenidos incluyen:</p><ul><li>La introducci贸n de un modelo de control de velocidad del buque reduce eficazmente el riesgo de balanceo param茅trico.</li><li>El algoritmo DDQN predice y mitiga con precisi贸n el balanceo param茅trico controlando la velocidad del buque.</li><li>Ajustar la configuraci贸n de la funci贸n de recompensa en DDQN permite cambios flexibles en los umbrales, mejorando la efectividad del algoritmo.</li></ul><p>En general, este estudio proporciona valiosos conocimientos sobre la mitigaci贸n de los riesgos de balanceo param茅trico y destaca el potencial del aprendizaje profundo por refuerzo para mejorar la seguridad mar铆tima.</p><h1>Recurso</h1><p>Enlace Original (Japon茅s): <a href='https://oacis.repo.nii.ac.jp/records/2000162' target='_blank'>Tesis de Maestr铆a</a></p>"
      },  
      {
        "slug": "co2-emission-viewer",
        "title": "Evaluaci贸n de Emisiones de CO2 por CII",
        "date": "2023-04-01",
        "category": "An谩lisis de Datos",
        "featuredImage": "../images/portfolio/02_co2-emission-viewer/p1.jpg",
        "excerpt": "Este es un proyecto de an谩lisis de datos que eval煤a las emisiones de CO2 mediante las tasas del Indicador de Intensidad de Carbono (CII) para diferentes a帽os. El proyecto aborda la creciente demanda de descarbonizaci贸n al analizar tendencias y patrones en las emisiones de carbono, con el objetivo de proporcionar conocimientos que apoyen los esfuerzos para reducir las emisiones de gases de efecto invernadero y promover pr谩cticas sostenibles.",
        "content": "<h1>Descripci贸n General</h1><p>El prop贸sito de este proyecto es analizar las emisiones de CO2 utilizando las tasas del Indicador de Intensidad de Carbono (CII) a lo largo de varios a帽os. Este an谩lisis es crucial para comprender el progreso y la efectividad de los esfuerzos de descarbonizaci贸n. Al evaluar estas tendencias, el proyecto tiene como objetivo identificar 谩reas clave para la mejora y estrategias para promover pr谩cticas sostenibles.</p><h1>Antecedentes</h1><p>Con el creciente enfoque global en la reducci贸n de las emisiones de gases de efecto invernadero, la industria mar铆tima est谩 bajo una presi贸n significativa para descarbonizarse. El Indicador de Intensidad de Carbono (CII) es una m茅trica utilizada para evaluar las emisiones de carbono de los buques en relaci贸n con la carga que transportan y la distancia recorrida. Monitorear y analizar las tasas de CII puede proporcionar valiosos conocimientos sobre la efectividad de varias estrategias de descarbonizaci贸n y ayudar a guiar los esfuerzos futuros.</p><h1>M茅todo</h1><p>El proyecto emplea un enfoque integral de an谩lisis de datos para evaluar las emisiones de CO2 utilizando las tasas de CII. Los pasos involucrados incluyen:</p><ul><li><strong>Recolecci贸n de Datos</strong>: Recopilaci贸n de datos hist贸ricos de emisiones de CO2 y tasas de CII para diferentes buques y a帽os.</li><li><strong>Procesamiento de Datos</strong>: Limpieza y organizaci贸n de los datos para garantizar la precisi贸n y consistencia.</li><li><strong>An谩lisis Estad铆stico</strong>: Uso de m茅todos estad铆sticos para identificar tendencias y patrones en los datos.</li><li><strong>Visualizaci贸n</strong>: Creaci贸n de gr谩ficos y tablas para representar visualmente los hallazgos.</li><li><strong>Interpretaci贸n</strong>: Interpretaci贸n de los resultados para extraer conclusiones significativas y proporcionar recomendaciones.</li></ul><h1>Resultados</h1><p>El an谩lisis de los datos de emisiones de CO2 revel贸 varios hallazgos clave:</p><ul><li>Las tasas de CII han mostrado una tendencia general decreciente a lo largo de los a帽os, lo que indica un progreso en los esfuerzos de descarbonizaci贸n.</li><li>Existen variaciones significativas en las tasas de CII entre diferentes tipos de buques y regiones, lo que resalta la necesidad de estrategias espec铆ficas.</li></ul><h1>Conclusi贸n</h1><p>Los hallazgos de este proyecto subrayan la importancia de la monitorizaci贸n y el an谩lisis continuos de las emisiones de CO2 utilizando las tasas de CII. Aunque ha habido avances en la reducci贸n de las emisiones de carbono, a煤n queda mucho trabajo por hacer. Los conocimientos obtenidos de este an谩lisis pueden informar las decisiones pol铆ticas y guiar los esfuerzos futuros de descarbonizaci贸n. La investigaci贸n y la innovaci贸n continuas son esenciales para lograr pr谩cticas sostenibles y minimizar el impacto ambiental de la industria mar铆tima.</p><h1>Visualizaci贸n de Datos</h1><p>Enlace al Dashboard: <a href='https://tatsuhiro-portfolio.streamlit.app/CO2_Emission_Viewer' target='_blank'>CO2 Emission Viewer</a></p>"
      },
      {
        "slug": "fishing-data-analysis",
        "title": "An谩lisis de Datos de Pesca: Proyecto de Tesis de Pregrado",
        "date": "2022-03-01",
        "category": "An谩lisis de Datos",
        "featuredImage": "../images/portfolio/01_fishing-catch-viewer/p1.jpg",
        "excerpt": "La captura de peces es un aspecto importante de la industria pesquera y est谩 altamente influenciada por varios factores como la especie, la ubicaci贸n, el tiempo, la velocidad del barco, entre otros. El objetivo de este proyecto es analizar los datos de captura de pesca para identificar tendencias y patrones en los datos. Los datos se recopilan de un barco pesquero e incluyen informaci贸n como la especie, la cantidad, la fecha y la ubicaci贸n.",
        "content": "<h1>Objetivo del Proyecto</h1><p>La captura de peces es un aspecto importante de la industria pesquera y est谩 altamente influenciada por varios factores como la especie, la ubicaci贸n, el tiempo, la velocidad del barco, entre otros. El objetivo de este proyecto es analizar los datos de captura de pesca para identificar tendencias y patrones en los datos. Los datos se recopilan de un barco pesquero e incluyen informaci贸n como la especie, la cantidad, la fecha y la ubicaci贸n.</p><h1>Introducci贸n</h1><p>La industria pesquera desempe帽a un papel crucial en la seguridad alimentaria global y la econom铆a, proporcionando una fuente principal de prote铆nas para millones de personas en todo el mundo. Comprender los factores que afectan las tasas de captura de peces es esencial para optimizar los esfuerzos de pesca, garantizar pr谩cticas sostenibles y maximizar los rendimientos. Este proyecto tiene como objetivo profundizar en los datos recopilados de los barcos pesqueros para descubrir c贸mo diversos factores como la especie, la ubicaci贸n, el tiempo y la velocidad del barco influyen en la cantidad de peces capturados. Al identificar estas tendencias y patrones, podemos contribuir a pr谩cticas de pesca m谩s eficientes y sostenibles.</p><h1>M茅todo</h1><p>Para lograr el objetivo de este proyecto, utilizamos datos recopilados de dispositivos de monitoreo instalados en barcos pesqueros. Estos dispositivos registraron informaci贸n detallada sobre cada viaje de pesca, incluyendo:</p><ul><li><strong>Especie</strong>: El tipo de pez capturado.</li><li><strong>Cantidad</strong>: La cantidad de peces capturados, medida en kilogramos.</li><li><strong>Fecha</strong>: La fecha y hora espec铆ficas en que se realiz贸 la actividad pesquera.</li><li><strong>Ubicaci贸n</strong>: Las coordenadas geogr谩ficas donde se realiz贸 la pesca.</li><li><strong>Velocidad del Barco</strong>: La velocidad del barco durante la actividad pesquera.</li></ul><p>Los datos se almacenaron en un formato estructurado, lo que permiti贸 un an谩lisis integral. Empleamos varias t茅cnicas de an谩lisis de datos, incluyendo an谩lisis estad铆stico y visualizaci贸n de datos, para identificar patrones y correlaciones significativas en los datos. Adem谩s, consideramos factores ambientales como las mareas y las corrientes para comprender su impacto en el 茅xito de la pesca.</p><h1>Resultados</h1><p>El an谩lisis de los datos de captura de pesca revel贸 varios hallazgos notables:</p><ul><li>Impacto de las Mareas y la Velocidad: La cantidad de peces capturados est谩 significativamente influenciada tanto por las mareas como por la velocidad del barco. Cuando el barco se dirige hacia la marea, las tasas de captura generalmente disminuyen en comparaci贸n con cuando sigue la marea. De manera similar, la velocidad del barco juega un papel crucial, identific谩ndose rangos de velocidad 贸ptimos que maximizan las tasas de captura. Las velocidades demasiado lentas o r谩pidas generalmente resultan en menores capturas.</li><li>Tendencias Espec铆ficas por Especie: Las diferentes especies de peces responden de manera diferente a las condiciones ambientales de las mareas y la velocidad del barco. Algunas especies son m谩s abundantes cuando el barco sigue la marea, mientras que otras pueden ser capturadas en mayor n煤mero cuando se dirigen hacia la marea. La velocidad del barco tambi茅n afecta a las especies de manera diferente, enfatizando la necesidad de estrategias de pesca espec铆ficas para cada especie.</li></ul><h1>Conclusi贸n</h1><p>Los hallazgos de este proyecto subrayan la importancia de considerar varios factores que influyen en el 茅xito de la pesca. Al comprender el impacto de las mareas, la velocidad del barco y los comportamientos espec铆ficos de las especies en las tasas de captura, se pueden optimizar las operaciones de pesca para mejorar la eficiencia y el rendimiento. Estos conocimientos pueden ayudar a los pescadores a tomar decisiones informadas, llevando a pr谩cticas de pesca m谩s sostenibles y una mejor gesti贸n de los recursos. Se recomienda una investigaci贸n continua y monitoreo para refinar estos hallazgos y adaptarse a las condiciones ambientales cambiantes.</p><p>Este proyecto demuestra el valor del an谩lisis de datos en la industria pesquera, proporcionando una base para futuros estudios y avances tecnol贸gicos destinados a mejorar la productividad y sostenibilidad de la pesca.</p><h1>Visualizaci贸n de Datos</h1><p>Enlace al Dashboard: <a href='https://tatsuhiro-portfolio.streamlit.app/Fishing_Catch_Viewer' target='_blank'>An谩lisis de Datos de Captura de Pesca</a></p>"
    }
  ] 
}
